export default {
  title: "กิจกรรม",
  description: "สำรวจกิจกรรมของเรา",
  seeAll: "ดูทั้งหมด",
  workshops: [
    {
      code: "kimino-logical",
      title: "Kimino Logical",
      description: "ซิงเกิลเปิดตัวสุดสดใส ชวนให้ทุกคนมารู้จักโลกของ Logic Gate",
      date: "2024-07-15",
    },
    {
      code: "aitagorithm",
      title: "Aitagorithm",
      description: "โชว์พิเศษที่รวมท่าเต้นแห่ง Algorithm ตั้งแต่ Sorting, B-Tree ไปจนถึง Shortest Path",
      date: "2024-07-15",
    },
    {
      code: "cmd-fortune",
      title: "CMD เสี่ยงทาย",
      description: "สเตจสุดท้าทายที่จะให้น้อง ๆ สวมบท \"แฮ็กเกอร์\" ใช้คำสั่งพื้นฐานของ Linux",
      date: "2024-07-15",
    },
    {
      code: "drawing",
      title: "Drawing",
      description: "Workshop การเขียนแบบด้วยมือ น้อง ๆ จะได้เรียนรู้การเขียนแบบทางวิศวกรรม การเขียนแบบใน 2 มิติ การเขียนแบบใน 3 มิติ หรือ รูป Isometric",
      date: "2024-07-15",
    },
    {
      code: "solidworks",
      title: "Solidworks",
      description: "Workshop การเขียนแบบด้วย Solidworks น้องๆจะได้เรียนรู้วิธีการใช้ Function และ Mode ต่างๆใน Solidworks",
      date: "2024-07-15",
    },
    {
      code: "productx1e",
      title: "PRO(DUCT)X1E 1st MINI ALBUM",
      description: "🎵 Track 1 : Bad Foundry – ดูเธอเต้นหน้าโรงหล่อ เปิดโชว์ด้วยการพาน้องๆ ไปรู้จักโลกของงานหล่อ",
      date: "2024-07-15",
    },
    {
      code: "ce",
      title: "วิศวกรรมโยธา",
      description: "สำรวจโลกของวิศวกรรมโยธา",
      date: "2024-07-16",
    },
    {
      code: "me",
      title: "วิศวกรรมเครื่องกล",
      description: "ทำความรู้จักกับวิศวกรรมเครื่องกล",
      date: "2024-07-17",
    },
    {
      code: "ee",
      title: "วิศวกรรมไฟฟ้า",
      description: "เรียนรู้เกี่ยวกับวิศวกรรมไฟฟ้า",
      date: "2024-07-18",
    },
  ],
};
