export default {
  title: "กิจกรรม",
  description: "สำรวจกิจกรรมของเรา",
  seeAll: "ดูทั้งหมด",
  workshops: [
    {
      code: "engi-technology",
      title: "Engi's Journey: สายเทคโนโลยี",
      description:
        "กิจกรรมที่เปิดโอกาสให้น้อง ๆ ได้รู้จักภาควิชาใน คณะวิศวกรรมศาสตร์ มจธ. อย่างใกล้ชิด ผ่านการ เดินทัวร์ภาควิชา",
      date: "10-12 ตุลาคม 2568",
    },
    {
      code: "engi-sustain",
      title: "Engi's Journey: สายความยั่งยืน",
      description:
        "กิจกรรมที่เปิดโอกาสให้น้อง ๆ ได้รู้จักภาควิชาใน คณะวิศวกรรมศาสตร์ มจธ. อย่างใกล้ชิด ผ่านการ เดินทัวร์ภาควิชา",
      date: "10-12 ตุลาคม 2568",
    },
    {
      code: "engi-elec",
      title: "Engi's Journey: สายไฟฟ้า",
      description:
        "กิจกรรมที่เปิดโอกาสให้น้อง ๆ ได้รู้จักภาควิชาใน คณะวิศวกรรมศาสตร์ มจธ. อย่างใกล้ชิด ผ่านการ เดินทัวร์ภาควิชา",
      date: "10-12 ตุลาคม 2568",
    },
    {
      code: "kimino-logical",
      title: "Kimino Logical",
      description: "ซิงเกิลเปิดตัวสุดสดใส ชวนให้ทุกคนมารู้จักโลกของ Logic Gate",
      date: "10-12 ตุลาคม 2568",
    },
    {
      code: "aitagorithm",
      title: "Aitagorithm",
      description:
        "โชว์พิเศษที่รวมท่าเต้นแห่ง Algorithm ตั้งแต่ Sorting, B-Tree ไปจนถึง Shortest Path",
      date: "10-12 ตุลาคม 2568",
    },
    {
      code: "cmd-fortune",
      title: "CMD เสี่ยงทาย",
      description: 'สเตจสุดท้าทายที่จะให้น้อง ๆ สวมบท "แฮ็กเกอร์" ใช้คำสั่งพื้นฐานของ Linux',
      date: "10-12 ตุลาคม 2568",
    },
    {
      code: "drawing",
      title: "Drawing",
      description:
        "Workshop การเขียนแบบด้วยมือ น้อง ๆ จะได้เรียนรู้การเขียนแบบทางวิศวกรรม การเขียนแบบใน 2 มิติ การเขียนแบบใน 3 มิติ หรือ รูป Isometric",
      date: "10-12 ตุลาคม 2568",
    },
    {
      code: "solidworks",
      title: "Solidworks",
      description:
        "Workshop การเขียนแบบด้วย Solidworks น้องๆจะได้เรียนรู้วิธีการใช้ Function และ Mode ต่างๆใน Solidworks",
      date: "10-12 ตุลาคม 2568",
    },
    {
      code: "productx1e",
      title: "PRO(DUCT)X1E 1st MINI ALBUM",
      description:
        "🎵 Track 1 : Bad Foundry – ดูเธอเต้นหน้าโรงหล่อ เปิดโชว์ด้วยการพาน้องๆ ไปรู้จักโลกของงานหล่อ",
      date: "10-12 ตุลาคม 2568",
    },
    {
      code: "star-stamp",
      title: "Star Stamp Station",
      description: "มาสัมผัสโลกของวัสดุแบบคูลๆ แถมยังได้เรียนรู้การขึ้นรูปยาง ในรูปแบบต่าง ๆ",
      date: "10-12 ตุลาคม 2568",
    },
    {
      code: "butter-bear",
      title: "Butter Bear Bookmark",
      description: "เพราะพวกเราจะเป็นที่ตั้งให้เธอพักฮีลใจ~",
      date: "10-12 ตุลาคม 2568",
    },
    {
      code: "geo",
      title: "ธรณี – Geotechnical 🌍",
      description: "แนะนำศาสตร์ด้านธรณีเทคนิค (Geotechnical)",
      date: "10-12 ตุลาคม 2568",
    },
    {
      code: "concrete",
      title: "คอนกรีต – Concrete 🧱",
      description: "แนะนำพื้นฐานเกี่ยวกับคอนกรีต (Concrete)",
      date: "10-12 ตุลาคม 2568",
    },
    {
      code: "structural",
      title: "โครงสร้างและการออกแบบ – Structural 🏗️",
      description: "เรียนรู้พื้นฐานเกี่ยวกับโครงสร้างทางวิศวกรรม",
      date: "10-12 ตุลาคม 2568",
    },
    {
      code: "water-resources",
      title: "ทรัพยากรน้ำ – Water Resources 💧",
      description: "เรียนรู้พื้นฐานด้านชลศาสตร์การไหล และวิศวกรรมแหล่งน้ำ",
      date: "10-12 ตุลาคม 2568",
    },
    {
      code: "survey",
      title: "Survey 🛠️📷",
      description: "ชวนทุกคนมาลองส่องกล้อง เรียนรู้เทคนิคการสำรวจ",
      date: "10-12 ตุลาคม 2568",
    },
    {
      code: "dream-for-green",
      title: "Dream for green (เส้นทางฝันเพื่อโลก)",
      description:
        "น้อง ๆ จะได้เห็นว่าน้ำที่ดูใส อาจไม่ได้สะอาดเสมอไป และการบำบัดน้ำคือศาสตร์ที่ผสมผสานทั้งวิทยาศาสตร์และวิศวกรรม",
      date: "10-12 ตุลาคม 2568",
    },
    {
      code: "escape-room",
      title: "Escape Room : ENVI Mission (ปริศนาไอดอลพิทักษ์โลก)",
      description:
        "ไม่ใช่แค่การ “เอาตัวรอดออกจากห้อง” แต่ยังเป็นการเรียนรู้ว่า “โลกใบนี้จะรอดได้ด้วยความร่วมมือของพวกเรา”",
      date: "10-12 ตุลาคม 2568",
    },
    {
      code: "melody-lab",
      title: "🎶 The Melody of Electricity Lab",
      description: "✨ “เมื่อโค้ดกลายเป็นเมโลดี้ ความฝันก็เปล่งประกายเหมือนไอดอล” ✨",
      date: "10-12 ตุลาคม 2568",
    },
    {
      code: "cooltech",
      title: "🌌🎶 CoolTech: ปลุกลมอัจฉริยะด้วยอุณหภูมิ",
      description: "✨ “เมื่ออุณหภูมิเปลี่ยน จังหวะของสายลมก็เปล่งประกายบนเวที” ✨",
      date: "10-12 ตุลาคม 2568",
    },
    {
      code: "measurement",
      title: "🔧 Measurement Lab",
      description: "เรียนรู้การใช้ เครื่องมือวัดทางไฟฟ้า ที่เกี่ยวข้องกับชีวิตประจำวัน",
      date: "10-12 ตุลาคม 2568",
    },
    {
      code: "motorlab",
      title: "⚙️ Motor Control Lab ",
      description: "ปูพื้นฐานการควบคุมการทำงานของมอเตอร์",
      date: "10-12 ตุลาคม 2568",
    },
    {
      code: "sensorlab",
      title: "Sensors Lab – “จังหวะแห่งความแม่นยำ”",
      description: "ทำความรู้จักกับเซนเซอร์หลากหลายชนิดในอุตสาหกรรม",
      date: "10-12 ตุลาคม 2568",
    },
    {
      code: "plc",
      title: "PLC Lab – “Hook แห่งการควบคุม”",
      description: "ฝึกเขียนโปรแกรมควบคุมด้วย PLC ผ่าน Ladder Diagram",
      date: "10-12 ตุลาคม 2568",
    },
    {
      code: "pid",
      title: "Water Flow Control (PID) Lab – “เมโลดี้แห่งการไหล”",
      description: "เรียนรู้หลักการควบคุมการไหลและความดัน การใช้วาล์วและการปรับ PID",
      date: "10-12 ตุลาคม 2568",
    },
    {
      code: "che",
      title: "CHEMENG IDOL",
      description:
        "ฐานเปิดประสบการณ์ที่แนะนำหลักสูตรวิศวกรรมเคมีทั้งภาคปกติและนานาชาติ พร้อมเล่าเรื่องโครงการ U-CHEPS และชี้แนะแนวทางอาชีพในอนาคต",
      date: "10-12 ตุลาคม 2568",
    },
  ],
};
