import thWorkshop from "../../assets/images/highlight/th/workshop.png";
import thExhibition from "../../assets/images/highlight/th/exhibition.png";
import thJourney from "../../assets/images/highlight/th/engi-journey.png";
import thIdol from "../../assets/images/highlight/th/idol.png";

export default {
  hero: {
    date: "10-12 ตุลาคม 2025",
    place: "ณ คณะวิศวกรรมศาสตร์\nมหาวิทยาลัยเทคโนโลยีพระจอมเกล้าธนบุรี",
  },
  highlight: {
    title: "ไฮไลท์",
    card: [
      {
        title: "เวิร์กช็อป",
        description:
          "กิจกรรมเวิร์กช็อปสุดมันส์ที่จะทำให้น้อง ๆ เปิดประตูสู่โลกของเด็กวิศวะบางมดแบบเต็มรูปแบบ เป็นโอกาสที่จะพาให้น้อง ๆ ไปสัมผัสประสบการณ์การเรียนรู้แบบจัดเต็ม ที่ไม่เหมือนการนั่งฟังบรรยายทั่วไป แต่เป็นการได้เจอกับทั้งอาจารย์ผู้เชี่ยวชาญ เจ้าหน้าที่ตัวจริง และรุ่นพี่จากทุกภาควิชา ที่พร้อมมาแชร์ความรู้ เคล็ดลับ และสาธิตการใช้งานเครื่องมือสุดล้ำที่เด็กวิศวะใช้กันจริง ๆ ในการเรียน ได้ค้นพบความชอบ ความถนัด และแรงบันดาลใจใหม่ ๆ ที่อาจกลายเป็นเส้นทางในอนาคตของตัวเอง งานนี้จัดเต็มทั้งสาระ ความสนุก และบรรยากาศสุดอบอุ่น บอกเลยว่าห้ามพลาดเด็ดขาด!",
        image: thWorkshop,
      },
      {
        title: "นิทรรศการ",
        description:
          "เตรียมตัวให้พร้อม! เพราะเราจะพาไปเปิดโลกกว้างกับการจัดแสดงผลงานและนวัตกรรมสุดครีเอทีฟจากพี่ ๆ วิศวะบางมด งานนี้ไม่ได้มีแค่การชมผลงานเท่ ๆ แต่ยังได้สัมผัสกระบวนการคิดและการพัฒนาที่พี่ ๆ ลงมือทำจริง พร้อมทำความรู้จักทั้ง 10 ภาควิชาแบบใกล้ชิด ทั้งหลักสูตร แนวทางการเรียน และเส้นทางอาชีพหลังเรียนจบ เหมือนได้ลองสวมบทเป็นเด็กวิศวะล่วงหน้าเลยทีเดียว อีกทั้งยังมีรุ่นพี่จากทุกภาคมาพูดคุยอย่างเป็นกันเอง แชร์ประสบการณ์จริง ตอบทุกข้อสงสัย ทั้งเรื่องเรียน กิจกรรม ชีวิตเด็กวิศวะ และโอกาสในอนาคต บอกเลยว่าสนุก ได้สาระ และแรงบันดาลใจกลับไปเต็ม ๆ มาเจอพี่ ๆ ได้ที่ Exhibition Hub ณ อาคารสำนักงานหอสมุด (N10) และ Exhibition ณ ภาควิชาต่าง ๆ ในพื้นที่คณะวิศวกรรมศาสตร์",
        image: thExhibition,
      },
      {
        title: "พี่พาน้องทัวร์",
        description:
          "กิจกรรมสุดพิเศษที่น้อง ๆ ห้ามพลาด! เราจะพาน้อง ๆ ไปเปิดโลกกับทุกภาควิชาของคณะวิศวกรรมศาสตร์ บางมด แบบใกล้ชิด ทั้งชมบรรยากาศจริงในห้องปฏิบัติการ เห็นเครื่องมือที่ใช้เรียนจริง พร้อมฟังเรื่องราวจากพี่ ๆ วิศวะตัวจริงเสียงจริง กิจกรรมนี้ไม่ใช่แค่การแนะนำภาควิชา แต่คือโอกาสที่จะช่วยให้น้อง ๆ ได้ค้นหาภาควิชาที่ใช่ เส้นทางที่ชอบ และแรงบันดาลใจใหม่ ๆ สำหรับอนาคต บอกเลยว่าบรรยากาศสนุก อบอุ่น และได้ทั้งความรู้กับมิตรภาพกลับไปเต็ม ๆ",
        image: thJourney,
      },
      {
        title: "พี่ต้นแบบ",
        description:
          "น้อง ๆ จะได้จับเข่าคุย ขอคำปรึกษา และเทคนิคการจัดทำ Portfolio การเตรียมตัวสอบเข้าสาขาวิชาต่าง ๆ ในคณะวิศวกรรมศาสตร์ จากรุ่นพี่นักศึกษาจากทั้ง 10 ภาควิชา แบบ one-on-one ",
        image: thIdol,
      },
    ],
  },
};
